OpenFOAM-dev/test/IO/fileHandler/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 77.9423 6.2)
    (135 0 6.2)
    (0 -77.9423 6.2)
    (300 -77.9423 6.2)
    (165 0 6.2)
    (300 77.9423 6.2)
    (300 500 6.2)
    (0 500 6.2)
    (0 77.9423 0)
    (135 0 0)
    (0 -77.9423 0)
    (300 -77.9423 0)
    (165 0 0)
    (300 77.9423 0)
    (300 500 0)
    (0 500 0)
);


blocks
(
    hex (8 13 14 15 0 5 6 7) (24 50 1) simpleGrading (1 1 1)
    hex (9 12 13 8 1 4 5 0) (24 8 1) simpleGrading (1 1 1)
    hex (10 11 12 9 2 3 4 1) (24 6 1) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 7 15 8)
            (1 0 8 9)
            (13 14 6 5)
            (12 13 5 4)
            (2 1 9 10)
            (11 12 4 3)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (4 5 0 1)
            (5 6 7 0)
            (15 14 13 8)
            (8 13 12 9)
            (3 4 1 2)
            (12 11 10 9)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (15 7 6 14)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 2 10 11)
        );
    }

);


// ************************************************************************* //
